Autodesk.Revit.DB.Structure.RebarShapeArcReferenceType
A Rebar Shape Definition constraint that is
measured to a bend must take the bar diameter into
account by specifying whether it measures to
the exterior, centerline, or interior of the bend.

Autodesk.Revit.DB.Structure.RebarShapeArcReferenceType.External
Measure to the exterior of the bend.

Autodesk.Revit.DB.Structure.RebarShapeArcReferenceType.Internal
Measure to the interior of the bend.

Autodesk.Revit.DB.Structure.RebarShapeArcReferenceType.Centerline
Measure to the centerline of the bar.